balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18LF23K22.PIC
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="ANSELC" edc:desc="PORTC analog select bits" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111111--" edc:name="ANSELC" edc:nzwidth="0x8" edc:por="111111--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ANSC2" edc:desc="RC2 analog select" edc:mask="0x1" edc:name="ANSC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC3" edc:desc="RC3 analog select" edc:mask="0x1" edc:name="ANSC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC4" edc:desc="RC4 analog select" edc:mask="0x1" edc:name="ANSC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC5" edc:desc="RC5 analog select" edc:mask="0x1" edc:name="ANSC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC6" edc:desc="RC6 analog select" edc:mask="0x1" edc:name="ANSC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSC7" edc:desc="RC7 analog select" edc:mask="0x1" edc:name="ANSC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PMD2" edc:desc="Power mode control bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PMD2" edc:nzwidth="0x8" edc:por="----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="ADC power mode control" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="Comparator 1 power mode control" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="Comparator 2 power mode control" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="CTMU power mode control" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="PMD1" edc:desc="Power mode control bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="PMD1" edc:nzwidth="0x8" edc:por="00-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="CCP1 power mode control" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="CCP2 power mode control" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="CCP3 power mode control" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP4MD" edc:desc="CCP4 power mode control" edc:mask="0x1" edc:name="CCP4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5MD" edc:desc="CCP5 power mode control" edc:mask="0x1" edc:name="CCP5MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MSSP1MD" edc:desc="MSSP1 power mode control" edc:mask="0x1" edc:name="MSSP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MSSP2MD" edc:desc="MSSP2 power mode control" edc:mask="0x1" edc:name="MSSP2MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD0" edc:desc="Power mode control bits" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMD0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="Timer1 power mode control" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="Timer2 power mode control" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="Timer3 power mode control" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="Timer4 power mode control" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="Timer5 power mode control" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="Timer6 power mode control" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="UART1 power mode control" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:desc="UART2 power mode control" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="VREFCON2" edc:desc="DAC voltage output select" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="VREFCON2" edc:nzwidth="0x8" edc:por="---00000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DACCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC Voltage output select" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
